Lzw655/esp-bsp/examples/p4/mipi_phone_fly/esp32_p4_function_ev_board/src/mipi_soc/include/mipi_dsi_host_struct.h
            uint32_t reserved20                    :    1;
            uint32_t reserved21                    :    11;
        };
        uint32_t val;
    } int_force1;
    uint32_t reserved_e0;
    uint32_t reserved_e4;
    uint32_t reserved_e8;
    uint32_t reserved_ec;
    union {
        struct {
            uint32_t compression_mode          :    1;
            uint32_t reserved1                     :    7;
            uint32_t compress_algo             :    2;
            uint32_t reserved10                    :    6;
            uint32_t pps_sel                   :    2;
            uint32_t reserved18                    :    14;
        };
        uint32_t val;
    } dsc_parameter;
    union {
        struct {
            uint32_t max_rd_time               :    15;
            uint32_t reserved15                    :    17;
        };
        uint32_t val;
    } phy_tmr_rd_cfg;
    uint32_t reserved_f8;
    uint32_t reserved_fc;
    union {
        struct {
            uint32_t vid_shadow_en             :    1;
            uint32_t reserved1                     :    7;
            uint32_t vid_shadow_req            :    1;
            uint32_t reserved9                     :    7;
            uint32_t vid_shadow_pin_req        :    1;
            uint32_t reserved17                    :    15;
        };
        uint32_t val;
    } vid_shadow_ctrl;
    uint32_t reserved_104;
    uint32_t reserved_108;
    union {
        struct {
            uint32_t dpi_vcid                 :    2;
            uint32_t reserved2                     :    30;
        };
        uint32_t val;
    } dpi_vcid_act;
    union {
        struct {
            uint32_t dpi_color_coding         :    4;
            uint32_t reserved4                     :    4;
            uint32_t loosely18_en             :    1;
            uint32_t reserved9                     :    23;
        };
        uint32_t val;
    } dpi_color_coding_act;
    uint32_t reserved_114;
    union {
        struct {
            uint32_t invact_lpcmd_time        :    8;
            uint32_t reserved8                     :    8;
            uint32_t outvact_lpcmd_time       :    8;
            uint32_t reserved24                    :    8;
        };
        uint32_t val;
    } dpi_lp_cmd_tim_act;
    union {
        struct {
            uint32_t hw_tear_effect_on         :    1;
            uint32_t hw_tear_effect_gen        :    1;
            uint32_t reserved2                     :    2;
            uint32_t hw_set_scan_line          :    1;
            uint32_t reserved5                     :    11;
            uint32_t scan_line_parameter       :    16;
        };
        uint32_t val;
    } edpi_te_hw_cfg;
    uint32_t reserved_120;
    uint32_t reserved_124;
    uint32_t reserved_128;
    uint32_t reserved_12c;
    uint32_t reserved_130;
    uint32_t reserved_134;
    union {
        struct {
            uint32_t vid_mode_type            :    2;
            uint32_t lp_vsa_en                :    1;
            uint32_t lp_vbp_en                :    1;
            uint32_t lp_vfp_en                :    1;
            uint32_t lp_vact_en               :    1;
            uint32_t lp_hbp_en                :    1;
            uint32_t lp_hfp_en                :    1;
            uint32_t frame_bta_ack_en         :    1;
            uint32_t lp_cmd_en                :    1;
            uint32_t reserved10                    :    22;
        };
        uint32_t val;
    } vid_mode_cfg_act;
    union {
        struct {
            uint32_t vid_pkt_size             :    14;
            uint32_t reserved14                    :    18;
        };
        uint32_t val;
    } vid_pkt_size_act;
    union {
        struct {
            uint32_t vid_num_chunks           :    13;
            uint32_t reserved13                    :    19;
        };
        uint32_t val;
    } vid_num_chunks_act;
    union {
        struct {
            uint32_t vid_null_size            :    13;
            uint32_t reserved13                    :    19;
        };
        uint32_t val;
    } vid_null_size_act;
    union {
        struct {
            uint32_t vid_hsa_time             :    12;
            uint32_t reserved12                    :    20;
        };
        uint32_t val;
    } vid_hsa_time_act;
    union {
        struct {
            uint32_t vid_hbp_time             :    12;
            uint32_t reserved12                    :    20;
        };
        uint32_t val;
    } vid_hbp_time_act;
    union {
        struct {
            uint32_t vid_hline_time           :    15;
            uint32_t reserved15                    :    17;
        };
        uint32_t val;
    } vid_hline_time_act;
    union {
        struct {
            uint32_t vsa_lines                :    10;
            uint32_t reserved10                    :    22;
        };
        uint32_t val;
    } vid_vsa_lines_act;
    union {
        struct {
            uint32_t vbp_lines                :    10;
            uint32_t reserved10                    :    22;
        };
        uint32_t val;
    } vid_vbp_lines_act;
    union {
        struct {
            uint32_t vfp_lines                :    10;
            uint32_t reserved10                    :    22;
        };
        uint32_t val;
    } vid_vfp_lines_act;
    union {
        struct {
            uint32_t v_active_lines           :    14;
            uint32_t reserved14                    :    18;
        };
        uint32_t val;
    } vid_vactive_lines_act;
    uint32_t reserved_164;
    union {
        struct {
            uint32_t dpi_cmd_w_empty               :    1;
            uint32_t dpi_cmd_w_full                :    1;
            uint32_t dpi_pld_w_empty               :    1;
            uint32_t dpi_pld_w_full                :    1;
            uint32_t reserved4                     :    1;
            uint32_t reserved5                     :    1;
            uint32_t reserved6                     :    1;
            uint32_t reserved7                     :    1;
            uint32_t reserved8                     :    8;
            uint32_t dpi_buff_pld_empty            :    1;
            uint32_t dpi_buff_pld_full             :    1;
            uint32_t reserved18                    :    2;
            uint32_t reserved20                    :    1;
            uint32_t reserved21                    :    1;
            uint32_t reserved22                    :    1;
            uint32_t reserved23                    :    1;
            uint32_t reserved24                    :    8;
        };
        uint32_t val;
    } vid_pkt_status;
    uint32_t reserved_16c;
    uint32_t reserved_170;
    uint32_t reserved_174;
    uint32_t reserved_178;
    uint32_t reserved_17c;
    uint32_t reserved_180;
    uint32_t reserved_184;
    uint32_t reserved_188;
    uint32_t reserved_18c;
    union {
        struct {
            uint32_t mode_3d                  :    2;
            uint32_t format_3d                :    2;
            uint32_t second_vsync             :    1;
            uint32_t right_first              :    1;
            uint32_t reserved6                     :    10;
            uint32_t send_3d_cfg              :    1;
            uint32_t reserved17                    :    15;
        };
        uint32_t val;
    } sdf_3d_act;
} mipi_dev_t;
extern mipi_dev_t MIPI_DSI_HOST;
#ifdef __cplusplus
}
#endif



#endif /*_SOC_MIPI_DSI_HOST_STRUCT_H_ */
